artillery.yml
# config:
#   target: 'https://localhost:3000'
#   phases:
#     - duration: 60
#       arrivalRate: 5
# scenarios:
#   - name: "get question test"
#   - flow:
#     - get:
#         url: "/qa"

# config:
#   target: "127.0.0.1:3000"
#   phases:
#     - duration: 60
#       arrivalCount: 20

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 1
      arrivalRate: 1000
scenarios:
  - flow:
    - get:
        url: "/qa"